{
    "1": {
        "id": 1,
        "title": "Weird Algorithm",
        "problemStatement": "Consider an algorithm that takes as input a positive integer n. If n is even, the algorithm divides it by two, and if n is odd, the algorithm multiplies it by three and adds one. The algorithm repeats this, until n is one.\nYour task is to simulate the execution of the algorithm for a given value of n.",
        "constraints": "1 <= n <= 1e6",
        "examples": {
            "input": "3",
            "output": "3 10 5 16 8 4 2 1"
        },
        "isSolved": false,
        "tag": "Introductory"
    },
    "2": {
        "id": 2,
        "title": "Missing Numbers",
        "problemStatement": "You are given all numbers between 1,2,...,n except one. Your task is to find the missing number.",
        "constraints": "2 <= n <= 2e5",
        "examples": {
            "input": "5<br>2 3 1 5",
            "output": "4"
        },
        "isSolved": true,
        "tag": "Introductory"
    },
    "3": {
        "id": 3,
        "title": "Repetitions",
        "problemStatement": "You are given a DNA sequence: a string consisting of characters A, C, G, and T. Your task is to find the longest repetition in the sequence. This is a maximum-length substring containing only one type of character.",
        "constraints": "1 <= n <= 1e6",
        "examples": {
            "input": "ATTCGGGA",
            "output": "3"
        },
        "isSolved": false,
        "tag": "Introductory"
    },
    "4": {
        "id": 4,
        "title": "Two Knights",
        "problemStatement": "Your task is to count for k=1,2,...,n the number of ways two knights can be placed on a k X k chessboard so that they do not attack each other.",
        "constraints": "1 <= n <= 10000",
        "examples": {
            "input": "8",
            "output": "6<br>28<br>96<br>252<br>550<br>1056<br>1848"
        },
        "isSolved": false,
        "tag": "Introductory"
    },
    "5": {
        "id": 5,
        "title": "Palindrome Reoder",
        "problemStatement": "Given a string, your task is to reorder its letters in such a way that it becomes a palindrome (i.e., it reads the same forwards and backwards). Print a palindrome consisting of the characters of the original string. You may print any valid solution. If there are no solutions, print 'NO SOLUTION'.",
        "constraints": "1 <= n <= 1e6",
        "examples": {
            "input": "AAAACACBA",
            "output": "AACABACAA"
        },
        "isSolved": false,
        "tag": "Introductory"
    },
    "6": {
        "id": 6,
        "title": "Subarray Sums I",
        "problemStatement": "Given an array of n positive integers, your task is to count the number of subarrays having sum x. The first input line has two integers n and x: the size of the array and the target sum x.The next line has n integers a_1,a_2,...,a_n: the contents of the array. Print one integer: the required number of subarrays.",
        "constraints": "1 <= n <= 2e5 <br> 1 <= x, a_i <= 1e9",
        "examples": {
            "input": "5 7<br>2 4 1 2 7",
            "output": "3"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "7": {
        "id": 7,
        "title": "Nearest Smaller Values",
        "problemStatement": "Given an array of n integers, your task is to find for each array position the nearest position to its left having a smaller value. The first input line has an integer n: the size of the array. The second line has n integers x_1,x_2,...,x_n: the array values. Print n integers: for each array position the nearest position with a smaller value. If there is no such position, print 0.",
        "constraints": "1 <= n <= 2e5 <br> 1 <= x_i <= 1e9",
        "examples": {
            "input": "8<br>2 5 1 4 8 3 2 5",
            "output": "0 1 0 3 4 3 3 7"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "8": {
        "id": 8,
        "title": "Reading Books",
        "problemStatement": "There are n books, and Kotivalo and Justiina are going to read them all. For each book, you know the time it takes to read it. They both read each book from beginning to end, and they cannot read a book at the same time. What is the minimum total time required? The first input line has an integer n: the number of books. The second line has n integers t_1,t_2,...,t_n: the time required to read each book. Print one integer: the minimum total time.",
        "constraints": "1 <= n <= 2e5 <br> 1 <= t_i <= 1e9",
        "examples": {
            "input": "3<br>2 8 3",
            "output": "16"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "9": {
        "id": 9,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Greedy"
    },
    "10": {
        "id": 10,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Trees"
    },
    "11": {
        "id": 11,
        "title": "Dice Combinations",
        "problemStatement": "Your task is to count the number of ways to construct sum n by throwing a dice one or more times. Each throw produces an outcome between 1 and  6. The only input line has an integer n. Print the number of ways modulo 10^9+7.",
        "constraints": "1 <= n <= 1e6",
        "examples": {
            "input": "3",
            "output": "4"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "12": {
        "id": 12,
        "title": "Minimizing Coins",
        "problemStatement": "Consider a money system consisting of n coins. Each coin has a positive integer value. Your task is to produce a sum of money x using the available coins in such a way that the number of coins is minimal. For example, if the coins are {1,5,7} and the desired sum is 11, an optimal solution is 5+5+1 which requires 3 coins. The first input line has two integers n and x: the number of coins and the desired sum of money. The second line has n distinct integers c_1,c_2,...,c_n: the value of each coin. Print one integer: the minimum number of coins. If it is not possible to produce the desired sum, print -1.",
        "constraints": "1 <= n <= 100 <br> 1 <= x <= 1e6 <br> 1 <= c_i <= 1e6",
        "examples": {
            "input": "3 11<br>1 5 7",
            "output": "3"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "13": {
        "id": 13,
        "title": "Coin Combinations I",
        "problemStatement": "Consider a money system consisting of n coins. Each coin has a positive integer value. Your task is to calculate the number of distinct ways you can produce a money sum x using the available coins. The first input line has two integers n and x: the number of coins and the desired sum of money. The second line has n distinct integers c_1,c_2,...,c_n: the value of each coin. Print one integer: the number of ways modulo 10^9+7.",
        "constraints": "1 <= n <= 100 <br> 1 <= x <= 1e6 <br> 1 <= c_i <= 1e6",
        "examples": {
            "input": "3 9<br>2 3 5",
            "output": "8"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "14": {
        "id": 14,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Greedy"
    },
    "15": {
        "id": 15,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Trees"
    },
    "16": {
        "id": 16,
        "title": "Counting Rooms",
        "problemStatement": "You are given a map of a building, and your task is to count the number of its rooms. The size of the map is n \times m squares, and each square is either floor or wall. You can walk left, right, up, and down through the floor squares. The first input line has two integers n and m: the height and width of the map. Then there are n lines of m characters describing the map. Each character is either . (floor) or # (wall). Print one integer: the number of rooms.",
        "constraints": "1 <= n, m <= 1000",
        "examples": {
            "input": "5 8 <br> ######## <br> #..#...# <br> ####.#.# <br> #..#...# <br> ########",
            "output": "3"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "17": {
        "id": 17,
        "title": "Labyrinth",
        "problemStatement": "You are given a map of a labyrinth, and your task is to find a path from start to end. You can walk left, right, up and down. The first input line has two integers n and m: the height and width of the map. Then there are n lines of m characters describing the labyrinth. Each character is . (floor), # (wall), A (start), or B (end). There is exactly one A and one B in the input. First print 'YES', if there is a path, and 'NO' otherwise. If there is a path, print the length of the shortest such path and its description as a string consisting of characters L (left), R (right), U (up), and D (down). You can print any valid solution.",
        "constraints": "1 <= n, m <= 1000",
        "examples": {
            "input": "5 8<br> ######## <br>#.A#...# <br> #.##.#B# <br> #......# <br>########",
            "output": "YES<br>9<br>LDDRRRRRU"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "18": {
        "id": 18,
        "title": "Building Roads",
        "problemStatement": "Byteland has n cities, and m roads between them. The goal is to construct new roads so that there is a route between any two cities. Your task is to find out the minimum number of roads required, and also determine which roads should be built. The first input line has two integers n and m: the number of cities and roads. The cities are numbered 1,2,..,n. After that, there are m lines describing the roads. Each line has two integers a and b: there is a road between those cities. A road always connects two different cities, and there is at most one road between any two cities. First print an integer k: the number of required roads. Then, print k lines that describe the new roads. You can print any valid solution.",
        "constraints": "1 <= n <= 1e5 <br> 1 <= m <= 2e5 <br> 1 <= a, b <= n",
        "examples": {
            "input": "4 2 <br>1 2<br>3 4",
            "output": "1 <br> 2 3"
        },
        "isSolved": false,
        "tag": "Graphs"
    },
    "19": {
        "id": 19,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Greedy"
    },
    "20": {
        "id": 20,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Trees"
    },
    "21": {
        "id": 21,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Graphs"
    },
    "22": {
        "id": 22,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": true,
        "tag": "Graphs"
    },
    "23": {
        "id": 23,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Graphs"
    },
    "24": {
        "id": 24,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Greedy"
    },
    "25": {
        "id": 25,
        "title": "",
        "problemStatement": "asdasdasdasdasdasd",
        "constraints": "",
        "examples": {},
        "isSolved": false,
        "tag": "Trees"
    }
}